clinic/app/Controllers/ClinicController.php

  public function viewrecords($id = null)
  {
    $ap = new AppointmentModel();
    $med = new SMed();
    $decrypted_id_raw = base64_decode($id);
    $decrypted_id = preg_replace(sprintf('/%s/', $this->secret()), '', $decrypted_id_raw);
    $where = "ClientID={$decrypted_id} and apstatus='done'";
    $data = [
      'smdata' => $ap->where($where)->findAll(),
      'id'     => $decrypted_id
    ];
---
SELECT *
FROM `appointment`
WHERE `ClientID` = 1 and `apstatus` = 'done'

  public function client()
  {

    $where = "type='student' or type='faculty' or type='staff'";
    $client = new UserModel();
    $data = [
      'area' => 'Client List',
      'smdata' => $client->where($where)->findAll(),
---
SELECT *
FROM `users`
WHERE `type` = 'student' or `type` = 'faculty' or `type` = 'staff'

  public function nschedule()
  {
    $ap = new AppointmentModel();
    $data = [
      'type' => 'pending',
      'smdata' => $ap->where('apstatus', 'pending')->orderBy('time', 'asc')->findAll()
    ];
---
SELECT *
FROM `appointment`
WHERE `apstatus` = 'pending'
ORDER BY `time` ASC

  public function history($id = null)
  {
    $med = new MedicineModel();
    $data = [
      'smdata' => $med->join('stocklogs', 'medicine.id=stocklogs.medID')->where('medicine.id', $id)->findAll()
    ];
---
SELECT *
FROM `medicine`
JOIN `stocklogs` ON `medicine`.`id`=`stocklogs`.`medID`
WHERE `medicine`.`id` = '1'