clinic/app/Controllers/ClinicController.php

  public function viewrecords($id = null)
  {
    $ap = new AppointmentModel();
    $med = new SMed();
    $medr = new MedicineRequestModel();
    $decrypted_id_raw = base64_decode($id);
    $decrypted_id = preg_replace(sprintf('/%s/', $this->secret()), '', $decrypted_id_raw);
    $where = "ClientID={$decrypted_id} and apstatus='done'";
    $nwer= "clientID={$decrypted_id}";
    $data = [
      'smdata' => $ap->where($where)->findAll(),
      'mede'    => $medr->where($nwer)->findAll(),
      'id'     => $decrypted_id
    ];
---
SELECT *
FROM `appointment`
WHERE `ClientID` = 6 and `apstatus` = 'done'

  public function client()
  {

    $where = "type='student' or type='faculty' or type='staff'";
    $client = new UserModel();
    $data = [
      'area' => 'Client List',
      'smdata' => $client->where($where)->findAll(),
      'secret' => $this->secret()
    ];
---
SELECT *
FROM `users`
WHERE `type` = 'student' or `type` = 'faculty' or `type` = 'staff'