clinic/app/Controllers/Home.php

SELECT *
FROM `appointment`
WHERE `date` = '2022-10-07'
---
  public function check()
  {
    $date = $this->request->getVar('date');
    // $time = $this->request->getVar('time');
    $sm = new AppointmentModel();
    if(isset($_POST['check'])){
      $data = [
        'schedule' => $sm->where('date', $date)->findAll(),
        'date'     => $date
      ];