clinic/app/Controllers/Home.php

SELECT *
FROM `medicine`
WHERE `stocks` >0
---
  public function rmedicine()
  {
    $session = session();
    $user = session()->get('aid');
    // echo $user;
    $med = new MedicineModel();

    if($user){
      $data = [
        'med' => $med->where('stocks > 0')->findAll()
      ];