clinic/app/Controllers/MainController.php

    public function auth()
    {
      $email = $this->request->getVar('username');
      $password = $this->request->getVar('password');
      // $url = $this->request->getVar('url');
      $session = session();
      // $session()->setTempdata('url', $url);
      $userModel = new UserModel();
      $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student'
 LIMIT 1